————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-



01：{"code":"0","data":["呼末二氧化碳","用户退出"],"msg":"用户退出"}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[获得结果, 34.95]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [564.95996, 3403.2793, 3414.6396] 1.96 34.95]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [3413.2192, 3414.1296, 3338.959] 30.77 34.95]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [3413.3896, 3336.219, 3204.2107] 34.19 34.44]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [3334.859, 3202.3806, 2859.5198] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [3198.5706, 2841.4001, 548.54] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [2821.56, 512.1699, 248.9901] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [461.76996, 249.20012, 259.15] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [249.27013, 259.27002, 268.33005] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [259.40002, 268.28006, 273.72998] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [268.1401, 274.37003, 275.32007] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}


//////


01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [275.07007, 275.24, 273.58005] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [275.24, 273.58005, 6294.51] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [273.72003, 6588.79, 8409.008] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [6735.91, 8272.316, 1330.5708] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [7862.228, 1330.7405, 1337.9904] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1330.8004, 1337.9904, 1331.1898] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1337.9503, 1330.95, 1326.4497] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1330.6403, 1326.4597, 1328.1809] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1326.4498, 1328.251, 1327.0704] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1328.221, 1327.1205, 1327.0903] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1326.9904, 1327.3604, 1330.7705] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1327.4303, 1330.7804, 1331.0804] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1330.7804, 1331.0804, 1333.5105] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1331.0004, 1333.5306, 1334.9403] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1333.5806, 1334.9403, 1345.5007] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1334.9203, 1345.7007, 1380.9594] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1346.1007, 1381.0192, 1353.4303] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1381.0192, 1353.4303, 1345.6896] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1353.2703, 1345.7195, 1343.02] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1345.5999, 1343.08, 1344.2998] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1343.1599, 1344.3898, 1348.5793] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1344.3898, 1348.5793, 1353.3801] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1348.5092, 1353.5804, 1351.0203] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1353.6606, 1351.0203, 1360.2704] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1351.0404, 1360.4303, 1396.5294] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请等待基线回复，稍候再试]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1360.8002, 1396.2694, 1357.25] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1395.9794, 1357.14, 1357.4801] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1357.1001, 1357.5902, 3630.33] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1357.6802, 3616.6802, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [3562.1104, 0.0, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 等待回复平稳基线]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 等待回复平稳基线]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [1800.0, 0.0, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳<br/>正在连接设备',type:''}

{"0":"onBtnClick","1":"00000","2":"呼末二氧化碳APP","3":"window.AndroidCallBack"}










————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-









01：{"code":"0","data":["呼末二氧化碳","用户退出"],"msg":"用户退出"}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [1595.1202, 7238.5903, 15000.0] 137.73 152.33]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [7648.5503, 15000.0, 9783.959] 13.34 152.33]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [15000.0, 9648.66, 1549.0297] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [9107.61, 1556.5797, 1948.31] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1562.1598, 1956.9299, 1794.4297] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1956.9299, 1794.4297, 1879.5797] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1792.1298, 1872.8997, 1552.2799] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1863.3198, 1563.3198, 1979.8997] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1567.2098, 1976.2697, 1673.7297] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1972.4397, 1671.6097, 1343.5703] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1665.4698, 1345.7001, 1542.7198] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1345.7001, 1542.7198, 1391.3801] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1542.4298, 1394.0702, 1937.29] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1394.0702, 1937.29, 1361.6194] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1937.29, 1361.6194, 1323.0204] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1344.1294, 1322.5703, 795.3899] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [1322.1202, 762.2398, 247.38008] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [751.17975, 248.35008, 278.68997] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [250.2701, 278.40994, 244.6] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [277.58997, 241.82002, 201.14995] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [242.51001, 201.26996, 187.72] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [200.92996, 187.39001, 176.76006] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [187.30002, 176.44006, 177.56001] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [176.13008, 178.23001, 256.76] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [178.90001, 256.9, 216.86005] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [256.76, 217.01003, 222.62999] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [216.74005, 220.76, 41.999996] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [217.83002, 38.189995, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [29.370005, 0.0, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [25.610004, 0.0, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳<br/>正在连接设备',type:''}

{"0":"onBtnClick","1":"00000","2":"呼末二氧化碳APP","3":"window.AndroidCallBack"}




————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-




01：{"code":"0","data":["呼末二氧化碳","用户退出"],"msg":"用户退出"}




01：co2；02：{"code":"0","data":["co2","34.66"],"msg":"操作成功"}



01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [170.87003, 848.05005, 3361.1506] 1.69 34.66]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [932.56, 3373.7002, 3342.7402] 1.75 34.66]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [3377.7603, 3341.8801, 3260.4705] 30.04 34.66]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [3338.35, 3257.9902, 3130.5713] 33.96 33.96]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 检查开始 [3257.2703, 3128.5813, 2972.4504] 32.96 33.06]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请缓慢呼气，尽量完全呼出]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 检查开始]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 检查开始]',type:'呼末二氧化碳'}



01：设备服务输出消息；02：{msg:'[当前co2, 待命 [3126.5613, 2970.5208, 2504.0305] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [2968.7107, 2493.0605, 602.37] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[请呼气...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [2458.9006, 560.33, 16.519999] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 待命 [520.53, 8.12, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[设备连接中...]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[结果, 待命]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳:<br/>[结果, 待命]',type:'呼末二氧化碳'}

01：设备服务输出消息；02：{msg:'[当前co2, 等待回复平稳基线 [46.130005, 0.0, 0.0] 0.0 -1000.0]',type:'通用消息'}

01：设备服务输出消息；02：{msg:'呼末二氧化碳<br/>正在连接设备',type:''}

{"0":"onBtnClick","1":"00000","2":"呼末二氧化碳APP","3":"window.AndroidCallBack"}


————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————----——————-
